In [1]:
import numpy as np
import pandas as pd

# PART 1: SERIES

This is an extension of the NumPy array. It has a lot of similarities, but with a difference in indexing capacity. NumPy arrays are only indexed via number notations corresponding to the desired rows and columns to be accessed. For Pandas series, the axes have labels that can be used for indexing their elements. Also, while NumPy arrays -- like Python lists, are essentially used for holding numeric data, Pandas series are used for holding any form of Python data/object.

## creating a pandas series

In [15]:
labels = ['first', 'second', 'third']

In [3]:
values = [10, 20, 30]

In [4]:
arr = np.arange(10, 31, 10)

In [5]:
arr

array([10, 20, 30])

In [6]:
dic = {'first':10, 'second':20, 'third':30}

In [7]:
dic

{'first': 10, 'second': 20, 'third': 30}

### creating series from python list

In [8]:
values

[10, 20, 30]

In [9]:
values_series = pd.Series(values)

In [10]:
values_series

0    10
1    20
2    30
dtype: int64

In [12]:
print(f"default series is: \n {values_series}")

default series is:
 0    10
1    20
2    30
dtype: int64

In [17]:
labels

['first', 'second', 'third']

In [18]:
values_series_with_labels = pd.Series(values, labels)

In [19]:
values_series_with_labels

first     10
second    20
third     30
dtype: int64

In [20]:
print(f"series with labels is: \n {values_series_with_labels}")

series with labels is:
 first     10
second    20
third     30
dtype: int64

### creating series from numpy arrays

In [22]:
arr_to_series = pd.Series(arr)

In [23]:
arr_to_series

0    10
1    20
2    30
dtype: int32

In [24]:
print(f"defualt series constructed from arrays is: \n {arr_to_series}")

defualt series constructed from arrays is:
 0    10
1    20
2    30
dtype: int32

In [25]:
arr_to_series_with_labels = pd.Series(arr, labels)

In [26]:
arr_to_series_with_labels

first     10
second    20
third     30
dtype: int32

In [27]:
print(f"series with lables bulit from numpy arrays and python list for labels: \n {arr_to_series_with_labels}")

series with lables bulit from numpy arrays and python list for labels:
 first     10
second    20
third     30
dtype: int32

### creating series from python dict

In [29]:
dict_to_series = pd.Series(dic)

In [30]:
dict_to_series

first     10
second    20
third     30
dtype: int64

### Interchanging labels and values
Pandas series also support the assignment of any data type or object as its data points.

In [32]:
labels

['first', 'second', 'third']

In [33]:
values

[10, 20, 30]

In [34]:
lables_as_value_series = pd.Series(labels, values)

In [36]:
lables_as_value_series                           # notice that the dtype now is "object"

10     first
20    second
30     third
dtype: object

### direct construct and indexing

In [40]:
ww2_countries = pd.Series([1, 2, 3, 4], ['USA', 'China', "Germany", 'japan'])

In [41]:
ww2_countries

USA        1
China      2
Germany    3
japan      4
dtype: int64

In [48]:
ww2_countries[0]

1

In [58]:
ww2_countries['USA']

1

So this is to say that when labels are strings, indexing can be either called by string-value or python index convention method

but if labels are numeric, only can be indexed by using that numeric value, but not python convetional indexing method start from 0

In [54]:
ww2_countries_2 = pd.Series(['USA', 'China', "Germany", 'japan'], np.arange(1,5))

In [55]:
ww2_countries_2

1        USA
2      China
3    Germany
4      japan
dtype: object

In [56]:
ww2_countries_2[1]

'USA'

In [57]:
ww2_countries_2[0]

KeyError: 0

### Panda series can be added together. It works best if the two series have similar labels and data points.

In [59]:
ww2_countries

USA        1
China      2
Germany    3
japan      4
dtype: int64

In [62]:
ww2_countries_3 = pd.Series([1,5,3,4], ['USA', 'USSR', 'Germany', 'japan'])

In [63]:
ww2_countries_3

USA        1
USSR       5
Germany    3
japan      4
dtype: int64

In [64]:
duoble = ww2_countries + ww2_countries

In [65]:
duoble

USA        2
China      4
Germany    6
japan      8
dtype: int64

In [66]:
mixed = ww2_countries + ww2_countries_3

In [67]:
mixed

China      NaN
Germany    6.0
USA        2.0
USSR       NaN
japan      8.0
dtype: float64

In [69]:
ww2_countries_2

1        USA
2      China
3    Germany
4      japan
dtype: object

In [70]:
ridiculous = ww2_countries + ww2_countries_2

D:\Anaconda\lib\site-packages\pandas\core\indexes\base.py:3772: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  return this.join(other, how=how, return_indexers=return_indexers)

In [71]:
ridiculous

USA        NaN
China      NaN
Germany    NaN
japan      NaN
1          NaN
2          NaN
3          NaN
4          NaN
dtype: object

# PART 2: DataFrame

A Pandas DataFrame is just an ordered collection of Pandas series with a common/shared index. At its basic form, a data frame looks more like an excel sheet with rows, columns, labels and headers. To create a data frame, the following syntax is used:

pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

Usually, the data input is an array of values (of whatever datatype). The index and column parameters are usually lists/vectors of either numeric or string type.

If a Pandas series is passed to a data frame object, the index automatically becomes the columns, and the data points are assigned accordingly.

## creating DataFrame

In [80]:
arr

array([10, 20, 30])

In [81]:
arr_to_series

0    10
1    20
2    30
dtype: int32

In [84]:
type(arr_to_series)

pandas.core.series.Series

In [85]:
df_0 = pd.DataFrame(arr_to_series)

In [86]:
df_0

    0
0  10
1  20
2  30

In [82]:
pool_1 = pd.Series([1,2,3,4],['USA','Britain','France','Germany'])

In [83]:
pool_1

USA        1
Britain    2
France     3
Germany    4
dtype: int64

In [78]:
pool_3 = pd.Series([1,5,3,4],['USA','USSR','France','Germany'])

In [79]:
pool_3

USA        1
USSR       5
France     3
Germany    4
dtype: int64

In [94]:
df_pool_1 = pd.DataFrame(pool_1)

In [95]:
df_pool_1

         0
USA      1
Britain  2
France   3
Germany  4

In [98]:
df_pool_1_1 = pd.DataFrame([pool_1])

Note the trick here: by passing pool_1 in [ ], the series labels (index) of pool_1 becomes the column header

In [109]:
df_pool_1_1

   USA  Britain  France  Germany
0    1        2       3        4

In [104]:
df_pool_3 = pd.DataFrame(pool_3)

In [105]:
df_pool_3

         0
USA      1
USSR     5
France   3
Germany  4

In [106]:
df_pool_3_1 = pd.DataFrame([pool_3])

In [107]:
df_pool_3_1

   USA  USSR  France  Germany
0    1     5       3        4

In [99]:
index = 'WWI WWII'.split()

In [100]:
index

['WWI', 'WWII']

In [102]:
df_new = pd.DataFrame([pool_1, pool_3], index)

In [103]:
df_new

      USA  Britain  France  Germany  USSR
WWI   1.0      2.0     3.0      4.0   NaN
WWII  1.0      NaN     3.0      4.0   5.0

## creating other DataFrame using numpy arrays and pythonic manipulation

In [111]:
arr = np.arange(1, 21).reshape(5, 4)

In [112]:
arr

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [119]:
row_labels = 'obs1 obs2 obs3 obs4 obs5'.split(" ")

In [120]:
row_labels

['obs1', 'obs2', 'obs3', 'obs4', 'obs5']

In [125]:
col_labels = 'odd1@even1@odd2@even2'.split('@')

In [126]:
col_labels

['odd1', 'even1', 'odd2', 'even2']

In [127]:
df_arr = pd.DataFrame(arr, row_labels, col_labels)

In [128]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [129]:
arr_randn = np.random.randn(5,4)

In [130]:
arr_randn

array([[-1.36596194,  1.12962653, -0.4290482 ,  0.7338245 ],
       [-0.48960151, -0.31319658,  0.23906239,  0.56187873],
       [-1.7338569 ,  0.02004018, -0.18291275, -0.2245037 ],
       [ 0.01210542, -0.95533468,  0.86009987,  0.74607066],
       [-0.92042343, -0.89373905, -0.12199852, -0.2119685 ]])

In [133]:
row_labels = 'obs1 obs2 obs3 obs4 obs5'.split()

In [134]:
row_labels

['obs1', 'obs2', 'obs3', 'obs4', 'obs5']

In [135]:
col_labels = 'num_serie_1 num_serie_2 num_serie_3 num_serie_4'.split()

In [136]:
col_labels

['num_serie_1', 'num_serie_2', 'num_serie_3', 'num_serie_4']

In [137]:
df_arr_randn = pd.DataFrame(arr_randn, row_labels, col_labels)

In [138]:
df_arr_randn

      num_serie_1  num_serie_2  num_serie_3  num_serie_4
obs1    -1.365962     1.129627    -0.429048     0.733825
obs2    -0.489602    -0.313197     0.239062     0.561879
obs3    -1.733857     0.020040    -0.182913    -0.224504
obs4     0.012105    -0.955335     0.860100     0.746071
obs5    -0.920423    -0.893739    -0.121999    -0.211969

## DataFrame grabbing

Tip: Things to note about data frames. 

They are a collection of series (more like a list with Pandas series as its elements). 

They are similar to numpy arrays i.e. they are more like nm dimensional matrices, where ‘n’ are the rows and ‘m’ are the columns.

### grabbing columns

In [139]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [140]:
df_arr['even1']                                   # grabbing a single column

obs1     2
obs2     6
obs3    10
obs4    14
obs5    18
Name: even1, dtype: int32

In [141]:
type(df_arr['even1'])                            # note the data type is Series

pandas.core.series.Series

In [144]:
df_arr[['even1', 'even2']]                        # grabbing multiple columns

      even1  even2
obs1      2      4
obs2      6      8
obs3     10     12
obs4     14     16
obs5     18     20

In [145]:
type(df_arr[['even1', 'even2']])                 # note the data type now is DataFrame

pandas.core.frame.DataFrame

### grabbing single item by firstly selecting column

In [146]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [147]:
df_arr['odd2']['obs4']

15

### grabbing rows

To grab rows, a different indexing method is used. You can use either:

data_frame_name.loc[‘row_name’] 

or 

data_frame_name.iloc[‘row_index’]

In [148]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [152]:
df_arr['obs4']                                # see grabbing rows cannot be done as cloumn grabbing

KeyError: 'obs4'

In [153]:
df_arr.loc['obs4']                              # to grab a row using literal string value of a index, we must first use .loc

odd1     13
even1    14
odd2     15
even2    16
Name: obs4, dtype: int32

In [154]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [155]:
df_arr.iloc[3]                                  # to use pythonic indexing method, use iloc then indexing

odd1     13
even1    14
odd2     15
even2    16
Name: obs4, dtype: int32

### grabbing single item by firstly selecting row

In [156]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [160]:
df_arr['odd2']['obs4']

15

In [161]:
df_arr['odd2'].loc['obs4']

15

In [162]:
df_arr['odd2'].iloc[3]

15

above 3 are firstly selecting column "odd2" then selecting rows, now doing from other side

In [166]:
df_arr.loc['obs4']['odd2']

15

In [167]:
df_arr.iloc[3]['odd2']

15

## adding & deleting new columns

In [169]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [170]:
df_arr['even_sum'] = df_arr['even1'] + df_arr['even2']

In [171]:
df_arr

      odd1  even1  odd2  even2  even_sum
obs1     1      2     3      4         6
obs2     5      6     7      8        14
obs3     9     10    11     12        22
obs4    13     14    15     16        30
obs5    17     18    19     20        38

In [172]:
df_arr['odd_sum'] = df_arr['odd1'] + df_arr['odd2']

In [173]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum
obs1     1      2     3      4         6        4
obs2     5      6     7      8        14       12
obs3     9     10    11     12        22       20
obs4    13     14    15     16        30       28
obs5    17     18    19     20        38       36

In [174]:
df_arr['total_sum'] = df_arr['even_sum'] + df_arr['odd_sum']

In [175]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum
obs1     1      2     3      4         6        4         10
obs2     5      6     7      8        14       12         26
obs3     9     10    11     12        22       20         42
obs4    13     14    15     16        30       28         58
obs5    17     18    19     20        38       36         74

### deleting a column using .drop() method

In [176]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum
obs1     1      2     3      4         6        4         10
obs2     5      6     7      8        14       12         26
obs3     9     10    11     12        22       20         42
obs4    13     14    15     16        30       28         58
obs5    17     18    19     20        38       36         74

In [177]:
df_arr['disposable'] = np.zeros(5)

In [178]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum  disposable
obs1     1      2     3      4         6        4         10         0.0
obs2     5      6     7      8        14       12         26         0.0
obs3     9     10    11     12        22       20         42         0.0
obs4    13     14    15     16        30       28         58         0.0
obs5    17     18    19     20        38       36         74         0.0

In [180]:
df_arr.drop('disposable')

KeyError: "['disposable'] not found in axis"

In [181]:
df_arr.drop('disposable', axis = 1 )

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum
obs1     1      2     3      4         6        4         10
obs2     5      6     7      8        14       12         26
obs3     9     10    11     12        22       20         42
obs4    13     14    15     16        30       28         58
obs5    17     18    19     20        38       36         74

In [182]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum  disposable
obs1     1      2     3      4         6        4         10         0.0
obs2     5      6     7      8        14       12         26         0.0
obs3     9     10    11     12        22       20         42         0.0
obs4    13     14    15     16        30       28         58         0.0
obs5    17     18    19     20        38       36         74         0.0

In [183]:
df_arr.drop('disposable', axis = 1, inplace = True)

In [184]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum
obs1     1      2     3      4         6        4         10
obs2     5      6     7      8        14       12         26
obs3     9     10    11     12        22       20         42
obs4    13     14    15     16        30       28         58
obs5    17     18    19     20        38       36         74

Notice the ‘axis=1’ and ‘inplace = True’ arguments. These are parameters that specify the location to perform the drop i.e. axis (axis = 0 specifies row operation), and intention to broadcast the drop to the original data frame, respectively. If ‘inplace= False’, the data frame will still contain the dropped column.

## conditional selection

In [185]:
df_arr

      odd1  even1  odd2  even2  even_sum  odd_sum  total_sum
obs1     1      2     3      4         6        4         10
obs2     5      6     7      8        14       12         26
obs3     9     10    11     12        22       20         42
obs4    13     14    15     16        30       28         58
obs5    17     18    19     20        38       36         74

In [186]:
df_arr.drop(['even_sum','odd_sum', 'total_sum'], axis = 1, inplace = True)

In [187]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [188]:
df_arr[df_arr > 5]

      odd1  even1  odd2  even2
obs1   NaN    NaN   NaN    NaN
obs2   NaN    6.0   7.0    8.0
obs3   9.0   10.0  11.0   12.0
obs4  13.0   14.0  15.0   16.0
obs5  17.0   18.0  19.0   20.0

### removing a row using a conditional check

In [189]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [190]:
df_arr_no_obs3 = df_arr.drop('obs3')      # using .drop() with default axis = 0 for rows

In [191]:
df_arr_no_obs3

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs4    13     14    15     16
obs5    17     18    19     20

In [192]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [193]:
df_arr[df_arr['odd1'] != 9]

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs4    13     14    15     16
obs5    17     18    19     20

In [194]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [198]:
df_arr[df_arr['even2'] <= 12]

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12

In [199]:
df_arr

      odd1  even1  odd2  even2
obs1     1      2     3      4
obs2     5      6     7      8
obs3     9     10    11     12
obs4    13     14    15     16
obs5    17     18    19     20

In [206]:
df_arr[(df_arr['odd1']>2) & (df_arr["even2"] < 13)]                       # have to use "&" instead of pythonic "and"

      odd1  even1  odd2  even2
obs2     5      6     7      8
obs3     9     10    11     12

## missing data

Another way to create a data frame is by using a dictionary. Remember, a python dictionary is somehow similar to a Pandas series in that they have key-value pairs, just as Pandas series are label-value pairs (although this is a simplistic comparison for the sake of conceptualization).

In [207]:
dico = {'X':[1,2,np.nan],'Y':[4,np.nan,np.nan],'Z':[7,8,9]}

In [208]:
dico

{'X': [1, 2, nan], 'Y': [4, nan, nan], 'Z': [7, 8, 9]}

In [209]:
series = pd.Series(dico)

In [210]:
series

X      [1, 2, nan]
Y    [4, nan, nan]
Z        [7, 8, 9]
dtype: object

In [226]:
df_from_series = pd.DataFrame(series)

In [227]:
df_from_series

               0
X    [1, 2, nan]
Y  [4, nan, nan]
Z      [7, 8, 9]

In [228]:
df_from_series_2 = pd.DataFrame([series])

In [229]:
df_from_series_2

             X              Y          Z
0  [1, 2, nan]  [4, nan, nan]  [7, 8, 9]

In [ ]:
### constructing directly from dict to DataFrame

In [230]:
df_no_touch = pd.DataFrame(dico)

In [231]:
df_no_touch               # so by default, Pandas automatically assign the keys of the dict into DataFrame's column header

     X    Y  Z
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

# so by default, Pandas automatically assign the keys of the dict into DataFrame's column header

In [232]:
row_labels = 'A B C'.split()

In [233]:
df_with_row_labels = pd.DataFrame(dico, row_labels)

In [234]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

### .dropna()

In [235]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

This removes any ‘null’ or ‘nan’ values in the data frame it’s called off, either column-wise or row-wise, depending on the axis specification and other arguments passed to the method. 
It has the following default syntax: 

df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

In [236]:
df_with_row_labels.dropna()

     X    Y  Z
A  1.0  4.0  7

In [237]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [238]:
df_with_row_labels.dropna(axis = 1)

   Z
A  7
B  8
C  9

In [239]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [243]:
df_with_row_labels.dropna(thresh = 2)               # 在行上去 NaN，至少有 '2' 个点是有数据的

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8

Notice how we have filtered out row C, since it contains only one actual value ‘9’.

In [244]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [245]:
df_with_row_labels.dropna(axis = 1, thresh = 2)

     X  Z
A  1.0  7
B  2.0  8
C  NaN  9

### .fillna()

This method has the following syntax: 

df.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)

In [246]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [249]:
df_with_row_labels.fillna('red')

     X    Y  Z
A    1    4  7
B    2  red  8
C  red  red  9

In [250]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [251]:
df_with_row_labels.fillna('green', axis = 1)

       X      Y  Z
A      1      4  7
B      2  green  8
C  green  green  9

In [252]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [255]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [257]:
df_with_row_labels['X'].fillna(df_with_row_labels['X'].mean())

A    1.0
B    2.0
C    1.5
Name: X, dtype: float64

In [258]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [261]:
for i in 'X Y Z'.split():
    df_with_row_labels[i].fillna(value = df_with_row_labels[i].mean(), inplace = True)

In [262]:
df_with_row_labels

     X    Y  Z
A  1.0  4.0  7
B  2.0  4.0  8
C  1.5  4.0  9

## .groupby( )

In [2]:
dict_sales = {'Sales Person':'Sam Charlie Amy Vanessa Carl Sarah'.split(),
        'Product':'Hp Hp Apple Apple Dell Dell'.split(),
        'Sales':[200,120,340,124,243,350]
       }

In [270]:
dict_sales

{'Sales Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Product': ['Hp', 'Hp', 'Apple', 'Apple', 'Dell', 'Dell'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [271]:
df_dict_no_touch = pd.DataFrame(dict_sales)

In [272]:
df_dict_no_touch

  Sales Person Product  Sales
0          Sam      Hp    200
1      Charlie      Hp    120
2          Amy   Apple    340
3      Vanessa   Apple    124
4         Carl    Dell    243
5        Sarah    Dell    350

In [5]:
row_labels = np.arange(1, 7)

In [6]:
row_labels

array([1, 2, 3, 4, 5, 6])

In [7]:
df_with_row_labels = pd.DataFrame(dict_sales, row_labels)

In [8]:
df_with_row_labels

  Sales Person Product  Sales
1          Sam      Hp    200
2      Charlie      Hp    120
3          Amy   Apple    340
4      Vanessa   Apple    124
5         Carl    Dell    243
6        Sarah    Dell    350

In [279]:
gb_product = df_with_row_labels.groupby("Product").sum()

In [281]:
gb_product

         Sales
Product
Apple      464
Dell       593
Hp         320

In [283]:
print(f"total sales by PRODUC-WISE is: \n {df_with_row_labels.groupby('Product').sum()}")         # .sum()

total sales by PRODUC-WISE is:
          Sales
Product
Apple      464
Dell       593
Hp         320

In [287]:
print(f"frequency by PRODUC-WISE is: \n {df_with_row_labels.groupby('Product').count()}")        # .count() for freq

frequency by PRODUC-WISE is:
          Sales Person  Sales
Product
Apple               2      2
Dell                2      2
Hp                  2      2

In [288]:
print(f"average sales by PRODUC-WISE is: \n {df_with_row_labels.groupby('Product').mean()}")        # .mean()

average sales by PRODUC-WISE is:
          Sales
Product
Apple    232.0
Dell     296.5
Hp       160.0

### .describe()

In [290]:
print(f"description by PRODUC-WISE is: \n {df_with_row_labels.groupby('Product').describe()}")        # .describe()

description by PRODUC-WISE is:
         Sales
        count   mean         std    min     25%    50%     75%    max
Product
Apple     2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Dell      2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Hp        2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0

In [295]:
df_with_row_labels.groupby('Product').describe().loc['Dell']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Dell, dtype: float64

In [9]:
lst_columns = list(df_with_row_labels.columns)

In [10]:
lst_columns

['Sales Person', 'Product', 'Sales']

In [14]:
for i in df.columns:
    print(df.groupby(i).describe())

             Sales
             count   mean std    min    25%    50%    75%    max
Sales Person
Amy            1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Carl           1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
Charlie        1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Sam            1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Sarah          1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
Vanessa        1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0
        Sales
        count   mean         std    min     25%    50%     75%    max
Product
Apple     2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Dell      2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Hp        2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
      Product                    Sales Person
        count unique    top freq        count unique      top freq
Sales
120         1      1     Hp    1            1      1  Charlie    1
124         1      1  Apple    1            1      1  Vanessa    1
200         1      1     Hp    1            1      1      Sam    1
243         1      1   Dell    1            1      1     Carl    1
340         1      1  Apple    1            1      1      Amy    1
350         1      1   Dell    1            1      1    Sarah    1

In [ ]:
for i in df.columns:
    print(df.groupby(i).count())

## Concatenate, Join and Merge

### concatenation

Concatenation allows datasets to be ‘glued’ together, either row-wise or column-wise. Here, the dimensions of the data frames must be the same along the axis of concatenation, i.e. row-wise concatenation requires the two data frames to have the same number of columns, and vice versa.

In [297]:
d1 = {'A':'A1 A2 A3'.split(),
      'B':'B1 B2 B3'.split(),
      'C':'C1 C2 C3'.split(),
      }

In [298]:
d2 = {'A':'A4 A5 A6'.split(),
      'B':'B4 B5 B6'.split(),
      'C':'C4 C5 C6'.split(),
     }

In [301]:
df1 = pd.DataFrame(d1, index = '1 2 3'.split())

In [302]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [305]:
df2 = pd.DataFrame(d2, '4 5 6'.split())

In [306]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

row-wise concat

In [308]:
pd.concat([df1, df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

column-wise concat

In [309]:
pd.concat([df1, df2], axis = 1)

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6

In [310]:
pd.concat([df1, df2], axis = 1, sort = True)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6

Notice how the result of the row-wise concatenation is just like placing the first data frame on top of the other. The attempt at column concatenation for these data frames resulted in NaNs because they have varying indices.

In [311]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

In [312]:
df2.index = '1 2 3'.split()

In [313]:
df2

    A   B   C
1  A4  B4  C4
2  A5  B5  C5
3  A6  B6  C6

In [314]:
pd.concat([df1, df2], axis = 1)

    A   B   C   A   B   C
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5
3  A3  B3  C3  A6  B6  C6

In [319]:
df2.columns

Index(['A', 'B', 'C'], dtype='object')

In [320]:
df2.columns = 'D E F'.split()

In [321]:
df2

    D   E   F
1  A4  B4  C4
2  A5  B5  C5
3  A6  B6  C6

In [323]:
pd.concat([df1, df2], axis = 1)

    A   B   C   D   E   F
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5
3  A3  B3  C3  A6  B6  C6

*** Merge and Join on the other hand, are more similar. They take two data frames and combine them together column-wise***

They both require a specification for a right and left data frame respectively to determine the organization. Also, they require an extra specification for an entry point (usually called a key) where the join or merge operation occurs. While the Merge and Join methods are powerful, we will not be exploring them here.

## reading & writing in Pandas

### reading

While Pandas can read SQL files, it is not necessarily the best for working with SQL databases, since there are quite a few SQL engines: SQL lite, PostgreSQL, MySQL, etc. Hence, we will only be considering CSV, Excel and HTML.

The pd.read_file_type(‘file_name’) method is the default way to read files into the Pandas framework. After import, pandas displays the content as a data frame for manipulation using all the methods we have practiced so far, and more.

#### CSV and Excel

In [325]:
pwd

'C:\\Users\\zixia\\Desktop\\1_PYTHON FOR DATA SCIENCE'

In [329]:
file = 'GermanData.csv'

In [331]:
csv_1 = pd.read_csv(file)[:5]

In [332]:
csv_1

,v1,v2,v3,v4,v5,v6,v7,v8,v9,v10,...,v12,v13,v14,v15,v16,v17,v18,v19,v20,y
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,...,A121,67,A143,A152,2,A173,1,A192,A201,0
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,...,A121,22,A143,A152,1,A173,1,A191,A201,1
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,...,A121,49,A143,A152,1,A172,2,A191,A201,0
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,...,A122,45,A143,A153,1,A173,2,A191,A201,0
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,...,A124,53,A143,A153,2,A173,2,A191,A201,1

In [338]:
excel_1 = pd.read_excel('experiment.xlsx')

In [339]:
excel_1[:5]

   x1   x2   x3  y
0   1  2.0  3.0  y
1   1  2.0  3.0  y
2   1  2.0  3.0  y
3   1  2.0  3.0  y
4   1  2.0  3.0  y

### write

In [342]:
excel_1[:3]

   x1   x2   x3  y
0   1  2.0  3.0  y
1   1  2.0  3.0  y
2   1  2.0  3.0  y

In [343]:
excel_for_write = excel_1[:3]

In [344]:
excel_for_write

   x1   x2   x3  y
0   1  2.0  3.0  y
1   1  2.0  3.0  y
2   1  2.0  3.0  y

In [346]:
excel_for_write.to_csv('written_csv.csv', index = False)

In [348]:
excel_for_write.to_excel('written_xlsx.xlsx', index = False)

Tip: You can also use this method to create spreadsheet files via Python. The False index parameter is to ensure that the automatic indexing of Jupyter is not written to the file, thereby messing up its formatting.

#### html

Html tables can be directly read into pandas using the pd.read_html (‘sheet url’) method. The sheet url is a web link to the data set to be imported.

Reading Html files through pandas requires a few libraries to be installed: htmllib5, lxml, and BeautifulSoup4. Since we installed the latest Anaconda, these libraries are likely to be included. Use conda list to verify, and conda install to install any missing ones.

In [352]:
w_data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [360]:
w_data

[                                             Bank Name                City  \
 0                     City National Bank of New Jersey              Newark
 1                                        Resolute Bank              Maumee
 2                                Louisa Community Bank              Louisa
 3                                 The Enloe State Bank              Cooper
 4                  Washington Federal Bank for Savings             Chicago
 5      The Farmers and Merchants State Bank of Argonia             Argonia
 6                                  Fayette County Bank          Saint Elmo
 7    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 8                                       First NBC Bank         New Orleans
 9                                        Proficio Bank  Cottonwood Heights
 10                       Seaway Bank and Trust Company             Chicago
 11                              Harvest Community Bank          Pennsville
 12                                         Allied Bank            Mulberry
 13                        The Woodbury Banking Company            Woodbury
 14                              First CornerStone Bank     King of Prussia
 15                                  Trust Company Bank             Memphis
 16                          North Milwaukee State Bank           Milwaukee
 17                              Hometown National Bank            Longview
 18                                 The Bank of Georgia      Peachtree City
 19                                        Premier Bank              Denver
 20                                      Edgebrook Bank             Chicago
 21                              Doral Bank  En Español            San Juan
 22                   Capitol City Bank & Trust Company             Atlanta
 23                             Highland Community Bank             Chicago
 24                    First National Bank of Crestview           Crestview
 25                                  Northern Star Bank             Mankato
 26              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 27               The National Republic Bank of Chicago             Chicago
 28                                      NBRS Financial          Rising Sun
 29                               GreenChoice Bank, fsb             Chicago
 ..                                                 ...                 ...
 529                                  ANB Financial, NA         Bentonville
 530                                          Hume Bank                Hume
 531                             Douglass National Bank         Kansas City
 532                                  Miami Valley Bank            Lakeview
 533                                            NetBank          Alpharetta
 534                          Metropolitan Savings Bank          Pittsburgh
 535                                    Bank of Ephraim             Ephraim
 536                                      Reliance Bank        White Plains
 537              Guaranty National Bank of Tallahassee         Tallahassee
 538                                Dollar Savings Bank              Newark
 539                               Pulaski Savings Bank        Philadelphia
 540              First National Bank of Blanchardville      Blanchardville
 541                              Southern Pacific Bank            Torrance
 542                        Farmers Bank of Cheneyville         Cheneyville
 543                                      Bank of Alamo               Alamo
 544             AmTrade International Bank  En Español             Atlanta
 545                     Universal Federal Savings Bank             Chicago
 546                       Connecticut Bank of Commerce            Stamford
 547                                   New Century Bank     Shelby Township
 548                              Net 1st National Bank          Boca Raton
 549                                       NextBank, NA             Phoenix
 550                           Oakwood Deposit Bank Co.             Oakwood
 551                              Bank of Sierra Blanca       Sierra Blanca
 552                      Hamilton Bank, NA  En Español               Miami
 553                             Sinclair National Bank            Gravette
 554                                 Superior Bank, FSB            Hinsdale
 555                                Malta National Bank               Malta
 556                    First Alliance Bank & Trust Co.          Manchester
 557                  National State Bank of Metropolis          Metropolis
 558                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    NJ  21111                      Industrial Bank    November 1, 2019
 1    OH  58317                   Buckeye State Bank    October 25, 2019
 2    KY  58112    Kentucky Farmers Bank Corporation    October 25, 2019
 3    TX  10716                   Legend Bank, N. A.        May 31, 2019
 4    IL  30570                   Royal Savings Bank   December 15, 2017
 5    KS  17719                          Conway Bank    October 13, 2017
 6    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 7    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 8    LA  58302                         Whitney Bank      April 28, 2017
 9    UT  35495                    Cache Valley Bank       March 3, 2017
 10   IL  19328                  State Bank of Texas    January 27, 2017
 11   NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 12   AR     91                         Today's Bank  September 23, 2016
 13   GA  11297                          United Bank     August 19, 2016
 14   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 15   TN   9956           The Bank of Fayette County      April 29, 2016
 16   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 17   WA  35156                       Twin City Bank     October 2, 2015
 18   GA  35259                        Fidelity Bank     October 2, 2015
 19   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 20   IL  57772             Republic Bank of Chicago         May 8, 2015
 21   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 22   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 23   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 24   FL  17557                       First NBC Bank    January 16, 2015
 25   MN  34983                            BankVista   December 19, 2014
 26   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 27   IL    916                  State Bank of Texas    October 24, 2014
 28   MD   4862                          Howard Bank    October 17, 2014
 29   IL  28462                 Providence Bank, LLC       July 25, 2014
 ..   ..    ...                                  ...                 ...
 529  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 530  MO   1971                        Security Bank       March 7, 2008
 531  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 532  OH  16848         The Citizens Banking Company     October 4, 2007
 533  GA  32575                           ING DIRECT  September 28, 2007
 534  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 535  UT   1249                        Far West Bank       June 25, 2004
 536  NY  26778                     Union State Bank      March 19, 2004
 537  FL  26838              Hancock Bank of Florida      March 12, 2004
 538  NJ  31330                          No Acquirer   February 14, 2004
 539  PA  27203                       Earthstar Bank   November 14, 2003
 540  WI  11639                        The Park Bank         May 9, 2003
 541  CA  27094                            Beal Bank    February 7, 2003
 542  LA  16445            Sabine State Bank & Trust   December 17, 2002
 543  TN   9961                          No Acquirer    November 8, 2002
 544  GA  33784                          No Acquirer  September 30, 2002
 545  IL  29355               Chicago Community Bank       June 27, 2002
 546  CT  19183                   Hudson United Bank       June 26, 2002
 547  MI  34979                          No Acquirer      March 28, 2002
 548  FL  26652                       Bank Leumi USA       March 1, 2002
 549  AZ  22314                          No Acquirer    February 7, 2002
 550  OH   8966       The State Bank & Trust Company    February 1, 2002
 551  TX  22002     The Security State Bank of Pecos    January 18, 2002
 552  FL  24382     Israel Discount Bank of New York    January 11, 2002
 553  AR  34248                   Delta Trust & Bank   September 7, 2001
 554  IL  32646                Superior Federal, FSB       July 27, 2001
 555  OH   6629                    North Valley Bank         May 3, 2001
 556  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 557  IL   3815              Banterra Bank of Marion   December 14, 2000
 558  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0      November 7, 2019
 1     November 12, 2019
 2      November 7, 2019
 3       August 22, 2019
 4         July 24, 2019
 5       August 12, 2019
 6      January 29, 2019
 7        March 22, 2018
 8      January 29, 2019
 9      January 29, 2019
 10     January 29, 2019
 11   September 20, 2019
 12         May 13, 2019
 13    December 13, 2018
 14    November 13, 2018
 15   September 14, 2018
 16     January 29, 2019
 17    February 19, 2018
 18         July 9, 2018
 19    February 20, 2018
 20     January 29, 2019
 21     January 29, 2019
 22     January 29, 2019
 23    November 15, 2017
 24    November 15, 2017
 25      January 3, 2018
 26    November 10, 2016
 27      January 6, 2016
 28     January 29, 2019
 29    December 12, 2016
 ..                  ...
 529    February 1, 2019
 530    January 31, 2019
 531    October 26, 2012
 532  September 12, 2016
 533    January 31, 2019
 534    October 27, 2010
 535       April 9, 2008
 536       April 9, 2008
 537      April 17, 2018
 538       April 9, 2008
 539     October 6, 2017
 540        June 5, 2012
 541    October 20, 2008
 542    October 20, 2004
 543      March 18, 2005
 544  September 11, 2006
 545     October 6, 2017
 546   February 14, 2012
 547      March 18, 2005
 548       April 9, 2008
 549    February 5, 2015
 550    October 25, 2012
 551    November 6, 2003
 552  September 21, 2015
 553     October 6, 2017
 554     August 19, 2014
 555   November 18, 2002
 556   February 18, 2003
 557      March 17, 2005
 558      March 17, 2005

 [559 rows x 7 columns]]

In [364]:
w_data[0][:5]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

In [16]:
html = pd.read_html('https://www.ers.usda.gov/data-products/fruit-and-vegetable-prices.aspx')

In [17]:
html

[                                             Data Set Last Updated  \
 0                                               Fruit          NaN
 1   Apples-Average retail price per pound or pint ...    7/11/2018
 2   Apricots-Average retail price per pound and pe...    7/11/2018
 3   Bananas-Average retail price per pound and per...    7/11/2018
 4   Berries (mixed)-Average retail price per pound...    7/11/2018
 5   Blackberries-Average retail price per pound an...    7/11/2018
 6   Blueberries-Average retail price per pound and...    7/11/2018
 7   Cantaloupe-Average retail price per pound and ...    7/11/2018
 8   Cherries-Average retail price per pound and pe...    7/11/2018
 9   Cranberries-Average retail price per pound and...    7/11/2018
 10  Dates-Average retail price per pound and per c...    7/11/2018
 11  Figs-Average retail price per pound and per cu...    7/11/2018
 12  Fruit cocktail-Average retail price per pound ...    7/11/2018
 13  Grapefruit-Average retail price per pound or p...    7/11/2018
 14  Grapes-Average retail price per pound or pint ...    7/11/2018
 15  Honeydew-Average retail price per pound and pe...    7/11/2018
 16  Kiwi-Average retail price per pound and per cu...    7/11/2018
 17  Mangoes-Average retail price per pound and per...    7/11/2018
 18  Nectarines-Average retail price per pound and ...    7/11/2018
 19  Oranges-Average retail price per pound or pint...    7/11/2018
 20  Papaya-Average retail price per pound and per ...    7/11/2018
 21  Peaches-Average retail price per pound and per...    7/11/2018
 22  Pears-Average retail price per pound and per c...    7/11/2018
 23  Pineapple-Average retail price per pound or pi...    7/11/2018
 24  Plums-Average retail price per pound or pint a...    7/11/2018
 25  Pomegranate-Average retail price per pound or ...    7/11/2018
 26  Raspberries-Average retail price per pound and...    7/11/2018
 27  Strawberries-Average retail price per pound an...    7/11/2018
 28  Tangerines-Average retail price per pound and ...    7/11/2018
 29  Watermelon-Average retail price per pound and ...    7/11/2018
 ..                                                ...          ...
 53  Kale-Average retail price per pound and per cu...    7/11/2018
 54  Kidney beans-Average retail price per pound an...    7/11/2018
 55  Lentils-Average retail price per pound and per...    7/11/2018
 56  Iceberg lettuce-Average retail price per pound...    7/11/2018
 57  Romaine lettuce-Average retail price per pound...    7/11/2018
 58  Lima beans-Average retail price per pound and ...    7/11/2018
 59  Mixed vegetables-Average retail price per poun...    7/11/2018
 60  Mushrooms-Average retail price per pound and p...    7/11/2018
 61  Mustard greens-Average retail price per pound ...    7/11/2018
 62  Navy beans-Average retail price per pound and ...    7/11/2018
 63  Okra-Average retail price per pound and per cu...    7/11/2018
 64  Olives-Average retail price per pound and per ...    7/11/2018
 65  Onions-Average retail price per pound and per ...    7/11/2018
 66  Pinto beans-Average retail price per pound and...    7/11/2018
 67  Potatoes-Average retail price per pound and pe...    7/11/2018
 68  Pumpkin-Average retail price per pound and per...    7/11/2018
 69  Radish-Average retail price per pound and per ...    7/11/2018
 70  Red peppers-Average retail price per pound and...    7/11/2018
 71  Spinach-Average retail price per pound and per...    7/11/2018
 72  Summer squash-Average retail price per pound a...    7/11/2018
 73  Sweet potatoes-Average retail price per pound ...    7/11/2018
 74  Tomatoes-Average retail price per pound and pe...    7/11/2018
 75  Turnip greens-Average retail price per pound a...    7/11/2018
 76           Archived 2013 Data Tables for Vegetables    7/11/2018
 77       Archived Data Tables for Snack Substitutions          NaN
 78  Snacks-Portion size, price/portion, and calori...   11/28/2012
 79  Snacks-Impact on food costs of substituting fr...   11/28/2012
 80  Snacks-Impact on caloric intake of substitutin...   11/28/2012
 81  Snacks-Average retail price and cost per porti...   11/28/2012
 82  Snacks-Average retail price and cost per porti...   11/28/2012

     Next Update
 0           NaN
 1           NaN
 2           NaN
 3           NaN
 4           NaN
 5           NaN
 6           NaN
 7           NaN
 8           NaN
 9           NaN
 10          NaN
 11          NaN
 12          NaN
 13          NaN
 14          NaN
 15          NaN
 16          NaN
 17          NaN
 18          NaN
 19          NaN
 20          NaN
 21          NaN
 22          NaN
 23          NaN
 24          NaN
 25          NaN
 26          NaN
 27          NaN
 28          NaN
 29          NaN
 ..          ...
 53          NaN
 54          NaN
 55          NaN
 56          NaN
 57          NaN
 58          NaN
 59          NaN
 60          NaN
 61          NaN
 62          NaN
 63          NaN
 64          NaN
 65          NaN
 66          NaN
 67          NaN
 68          NaN
 69          NaN
 70          NaN
 71          NaN
 72          NaN
 73          NaN
 74          NaN
 75          NaN
 76          NaN
 77          NaN
 78          NaN
 79          NaN
 80          NaN
 81          NaN
 82          NaN

 [83 rows x 3 columns]]

In [18]:
html[0]

,Data Set,Last Updated,Next Update
0,Fruit,NaN,NaN
1,Apples-Average retail price per pound or pint ...,7/11/2018,NaN
2,Apricots-Average retail price per pound and pe...,7/11/2018,NaN
3,Bananas-Average retail price per pound and per...,7/11/2018,NaN
4,Berries (mixed)-Average retail price per pound...,7/11/2018,NaN
5,Blackberries-Average retail price per pound an...,7/11/2018,NaN
6,Blueberries-Average retail price per pound and...,7/11/2018,NaN
7,Cantaloupe-Average retail price per pound and ...,7/11/2018,NaN
8,Cherries-Average retail price per pound and pe...,7/11/2018,NaN
9,Cranberries-Average retail price per pound and...,7/11/2018,NaN
10,Dates-Average retail price per pound and per c...,7/11/2018,NaN
11,Figs-Average retail price per pound and per cu...,7/11/2018,NaN
12,Fruit cocktail-Average retail price per pound ...,7/11/2018,NaN
13,Grapefruit-Average retail price per pound or p...,7/11/2018,NaN
14,Grapes-Average retail price per pound or pint ...,7/11/2018,NaN
15,Honeydew-Average retail price per pound and pe...,7/11/2018,NaN
16,Kiwi-Average retail price per pound and per cu...,7/11/2018,NaN
17,Mangoes-Average retail price per pound and per...,7/11/2018,NaN
18,Nectarines-Average retail price per pound and ...,7/11/2018,NaN
19,Oranges-Average retail price per pound or pint...,7/11/2018,NaN
20,Papaya-Average retail price per pound and per ...,7/11/2018,NaN
21,Peaches-Average retail price per pound and per...,7/11/2018,NaN
22,Pears-Average retail price per pound and per c...,7/11/2018,NaN
23,Pineapple-Average retail price per pound or pi...,7/11/2018,NaN
24,Plums-Average retail price per pound or pint a...,7/11/2018,NaN
25,Pomegranate-Average retail price per pound or ...,7/11/2018,NaN
26,Raspberries-Average retail price per pound and...,7/11/2018,NaN
27,Strawberries-Average retail price per pound an...,7/11/2018,NaN
28,Tangerines-Average retail price per pound and ...,7/11/2018,NaN
29,Watermelon-Average retail price per pound and ...,7/11/2018,NaN
...,...,...,...
53,Kale-Average retail price per pound and per cu...,7/11/2018,NaN
54,Kidney beans-Average retail price per pound an...,7/11/2018,NaN
55,Lentils-Average retail price per pound and per...,7/11/2018,NaN
56,Iceberg lettuce-Average retail price per pound...,7/11/2018,NaN
57,Romaine lettuce-Average retail price per pound...,7/11/2018,NaN
58,Lima beans-Average retail price per pound and ...,7/11/2018,NaN
59,Mixed vegetables-Average retail price per poun...,7/11/2018,NaN
60,Mushrooms-Average retail price per pound and p...,7/11/2018,NaN
61,Mustard greens-Average retail price per pound ...,7/11/2018,NaN
62,Navy beans-Average retail price per pound and ...,7/11/2018,NaN
63,Okra-Average retail price per pound and per cu...,7/11/2018,NaN
64,Olives-Average retail price per pound and per ...,7/11/2018,NaN
65,Onions-Average retail price per pound and per ...,7/11/2018,NaN
66,Pinto beans-Average retail price per pound and...,7/11/2018,NaN
67,Potatoes-Average retail price per pound and pe...,7/11/2018,NaN
68,Pumpkin-Average retail price per pound and per...,7/11/2018,NaN
69,Radish-Average retail price per pound and per ...,7/11/2018,NaN
70,Red peppers-Average retail price per pound and...,7/11/2018,NaN
71,Spinach-Average retail price per pound and per...,7/11/2018,NaN
72,Summer squash-Average retail price per pound a...,7/11/2018,NaN
73,Sweet potatoes-Average retail price per pound ...,7/11/2018,NaN
74,Tomatoes-Average retail price per pound and pe...,7/11/2018,NaN
75,Turnip greens-Average retail price per pound a...,7/11/2018,NaN
76,Archived 2013 Data Tables for Vegetables,7/11/2018,NaN
77,Archived Data Tables for Snack Substitutions,NaN,NaN
78,"Snacks-Portion size, price/portion, and calori...",11/28/2012,NaN
79,Snacks-Impact on food costs of substituting fr...,11/28/2012,NaN
80,Snacks-Impact on caloric intake of substitutin...,11/28/2012,NaN
81,Snacks-Average retail price and cost per porti...,11/28/2012,NaN
82,Snacks-Average retail price and cost per porti...,11/28/2012,NaN

# Excercise

In [1]:
ls

 驱动器 C 中的卷是 Windows
 卷的序列号是 004E-7B97

 C:\Users\zixia\Desktop\1_PYTHON FOR DATA SCIENCE 的目录

2019/12/01  13:52    <DIR>          .
2019/12/01  13:52    <DIR>          ..
2019/12/01  11:22    <DIR>          .ipynb_checkpoints
2019/11/27  10:03                24 asciiart.txt
2019/11/28  17:20                49 Awesome_numPy_tutorial.txt
2019/11/28  09:36            75,063 Chap_1.ipynb
2019/11/29  09:44            70,394 Chap_2_numPy.ipynb
2019/12/01  13:52           277,925 Chap_2_Pandas.ipynb
2019/11/29  17:16             9,750 experiment.xlsx
2019/01/28  11:24            80,855 GermanData.csv
2019/11/27  09:43                69 Jupyter_Advice.txt
2019/11/29  17:32                22 kaggle.txt
2019/11/26  06:02           153,519 PYTHON FOR DATA SCIENCE_ The Ultimate Beginners’ Guide to Learning Python Data Science Step by Step_B07WJBRBP7.kfx
2019/11/29  17:32        12,036,800 sf-salaries.zip
2019/12/01  11:20               904 WRITE_OBJ.csv
2019/11/29  17:22                51 written_csv
2019/11/29  17:22                51 written_csv.csv
2019/11/30  15:45               883 written_first_10.csv
2019/11/29  17:23             5,448 written_xlsx.xlsx
              16 个文件     12,711,807 字节
               3 个目录 37,144,662,016 可用字节

In [2]:
ls

 驱动器 C 中的卷是 Windows
 卷的序列号是 004E-7B97

 C:\Users\zixia\Desktop\1_PYTHON FOR DATA SCIENCE 的目录

2019/12/01  13:53    <DIR>          .
2019/12/01  13:53    <DIR>          ..
2019/12/01  11:22    <DIR>          .ipynb_checkpoints
2019/11/27  10:03                24 asciiart.txt
2019/11/28  17:20                49 Awesome_numPy_tutorial.txt
2019/11/28  09:36            75,063 Chap_1.ipynb
2019/11/29  09:44            70,394 Chap_2_numPy.ipynb
2019/12/01  13:52           279,620 Chap_2_Pandas.ipynb
2019/11/29  17:16             9,750 experiment.xlsx
2019/01/28  11:24            80,855 GermanData.csv
2019/11/27  09:43                69 Jupyter_Advice.txt
2019/11/29  17:32                22 kaggle.txt
2019/11/26  06:02           153,519 PYTHON FOR DATA SCIENCE_ The Ultimate Beginners’ Guide to Learning Python Data Science Step by Step_B07WJBRBP7.kfx
2019/12/01  13:53    <DIR>          sf-salaries
2019/12/01  11:20               904 WRITE_OBJ.csv
2019/11/29  17:22                51 written_csv
2019/11/29  17:22                51 written_csv.csv
2019/11/30  15:45               883 written_first_10.csv
2019/11/29  17:23             5,448 written_xlsx.xlsx
              15 个文件        676,702 字节
               4 个目录 37,113,942,016 可用字节

In [2]:
cd sf-salaries

C:\Users\zixia\Desktop\1_PYTHON FOR DATA SCIENCE\sf-salaries

In [5]:
ls

 驱动器 C 中的卷是 Windows
 卷的序列号是 004E-7B97

 C:\Users\zixia\Desktop\1_PYTHON FOR DATA SCIENCE\sf-salaries 的目录

2019/12/01  14:11    <DIR>          .
2019/12/01  14:11    <DIR>          ..
2019/12/01  13:53    <DIR>          database.sqlite
2019/12/01  13:53    <DIR>          Salaries
               0 个文件              0 字节
               4 个目录 37,080,760,320 可用字节

In [6]:
cd Salaries

C:\Users\zixia\Desktop\1_PYTHON FOR DATA SCIENCE\sf-salaries\Salaries

In [7]:
ls

 驱动器 C 中的卷是 Windows
 卷的序列号是 004E-7B97

 C:\Users\zixia\Desktop\1_PYTHON FOR DATA SCIENCE\sf-salaries\Salaries 的目录

2019/12/01  13:53    <DIR>          .
2019/12/01  13:53    <DIR>          ..
2019/11/05  18:28        16,257,213 Salaries.csv
               1 个文件     16,257,213 字节
               2 个目录 37,080,625,152 可用字节

In [9]:
df = pd.read_csv('Salaries.csv')

D:\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:3020: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [13]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [15]:
df.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [16]:
df.size

1932502

In [17]:
df.ndim

2

In [18]:
df.shape

(148654, 13)

In [19]:
highest_pay = df['TotalPay'].max()

In [20]:
highest_pay

567595.43

In [23]:
monica = df[df['EmployeeName'] == 'MONICA FIELDS']

In [24]:
monica

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
29,30,MONICA FIELDS,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",246226,0,15140.5,NaN,261366.14,261366.14,2011,NaN,San Francisco,NaN

In [26]:
type(monica)

pandas.core.frame.DataFrame

In [27]:
monica['JobTitle']

29    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
Name: JobTitle, dtype: object

In [40]:
monica['TotalPay']

29    246226
Name: BasePay, dtype: object

In [45]:
df['BasePay'].describe()

count     148049.0
unique    109900.0
top            0.0
freq         875.0
Name: BasePay, dtype: float64

In [47]:
df['BasePay']

0               167411
1               155966
2               212739
3                77916
4               134402
5               118602
6                92492
7               256577
8               176933
9               285262
10              194999
11               99722
12              294580
13              271329
14              174873
15              198778
16              268605
17              140547
18              168693
19              257511
20              257510
21              257510
22              140547
23              168693
24              140547
25              256470
26             92080.8
27              168693
28              261718
29              246226
              ...
148624            0.00
148625            0.00
148626            0.00
148627            0.00
148628            0.00
148629            0.00
148630            0.00
148631            0.00
148632            0.00
148633            0.00
148634            0.00
148635            0.00
148636            0.00
148637            0.00
148638            0.00
148639            0.00
148640            0.00
148641            0.00
148642            0.00
148643            0.00
148644            0.00
148645            0.00
148646    Not Provided
148647            0.00
148648            0.00
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [46]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN